;*****************************************************************************;
;            Language set file for plugins used by NativeLang.dll             ;
;*****************************************************************************;
;                                                                             ;
; Please change the file and distribute to the corresponding developer.       ;
;                                                                             ;
;*****************************************************************************;

[MultiClipboard.dll NppMenu]
Main="&MultiClipboard"
0="&MultiClip Viewer...%tCtrl+Alt+V"
1="MultiClipboard &Paste%tCtrl+Shift+V"
2="&Options..."
3="&About..."

[MultiClipboard.dll About]
Caption="About"
30550="Author:"
30551="MultiClipboard Plugin v2.0 for Notepad++"
30552="Author:%t%tLoonyChewy"
30553="eMail:"
30555="URL:"
30557="Menu entries"
30558="MultiClip Viewer...%t%tToggles the MultiClip Viewer."
30559="MultiClipboard Paste%t%tShows the paste menu."
30560="Options...%t%t%tShows the option dialog."
30561="About...%t%t%tShows this dialog."

[MultiClipboard.dll Options]
Caption="MultiClipboard Options"
1003="Number of clip texts to store"
1004="Copy text from other programs"
1005="But only when pasted into Notepad++"
1006="Use paste menu (Uncheck: Use cyclic paste)"
1007="Use numbered mnemonics in paste menu"
1009="Width of paste menu"
1010="Auto copy text selection"
1011="Use middle click paste"

[MultiClipboard.dll Text]
MultiClip Viewer="MultiClip Viewer"
Move Item Up="Move Item Up"
Move Item Down="Move Item Down"
Paste Item="Paste Item"
Delete Item="Delete Item"
1002_HELP="Maximum number of text to be stored in clipboard buffer"
1003_HELP="Maximum number of text to be stored in clipboard buffer"
1004_HELP="Get text that are copied from other programs"
1005_HELP="When 'Copy text from other programs' is true, then text is only copied when it is immediately pasted into Notepad++"
1006_HELP="Use paste menu instead of cyclic paste when Ctrl-Shift-V"
1007_HELP="Use numbers as shortcut keys for selecting menu items instead of the first character of the text"
1008_HELP="Maximum number of characters to display per text on the paste menu"
1009_HELP="Maximum number of characters to display per text on the paste menu"
1010_HELP="Automatically copies selected text into clipboard"
1011_HELP="Click middle mouse button to paste text from clipboard. Shift-middle click will show paste menu"
